// src/components/Container.js
import React from 'react';
// Определяем функциональный компонент Container, который принимает одно свойство: children
const Container = ({ children }) => {
    return (
        // Возвращаем элемент div, который будет содержать переданные дочерние элементы (children)
        // Устанавливаем стиль: внутренний отступ 20 пикселей и границу толщиной 1 пиксель светло-серого цвета
        <div style={{ padding: '20px', border: '1px solid #ccc' }}>
            {children}
        </div>
    );
};

export default Container;
//использование свойства children в компоненте Container служит для того, 
// чтобы обеспечить возможность помещать любое содержимое внутри контейнера, 
// которое мы хотим отобразить на странице. Это позволяет сделать компонент Container более универсальным и многоразовым.