import React from 'react';

const Content = ({ labId }) => {
  const labContent = {
    0: {
      title: "Главная страница",
      text: "Добро пожаловать! Выберите лабораторную работу из меню слева."
    },
    1: {
      title: "Лабораторная 1",
      text: "Реализовать скрипт, который уведомит о полной загрузке страницы. Реализовать кнопку счетчик, которая будет увеличивать счетчик на 1 и вывести его значение на страницу (button onclick). Реализовать кнопку счетчик, которая будет уменьшать счетчик на 1 реализовать с помощью listener click. Реализовать форму аутентификации пользователя (<form>). Реализовать скрипт очистки данных формы. Реализовать скрипт отправки данных формы с помощью listener submit. Без отправки на сервер провести валидацию введенных данных, если login==admin & pass==admin вывести сообщение об успехе, иначе сообщение о неуспехе. Реализовать скрипт сохранения учетных данных и автоподстановку оных с помощью localStorage"
    },
    2: {
      title: "Лабораторная 2", 
      text: "Создать Hello World приложение на основе React. Для создания можно использовать create-react-app или vite. Реализовать компонент кнопку, контейнер и использовать их на странице. Реализовать шаблон страницы и разместить на нем компоненты навигации. Разместить проект в репозиторий в github. Прикрепить текстовый файл с сылкой на проект"
    },
    3: {
      title: "Лабораторная 3",
      text: "Реализуем компоненты Header, Footer, Menu и Content. В меню выводим список лабораторных работ. В Content  выводим содержимое лабораторной работы. Разместить проект в репозиторий в github. Прикрепить текстовый файл с сылкой на проект"
    }
  };

  return (
    <div className="content">
      <h2>{labContent[labId].title}</h2>
      <p>{labContent[labId].text}</p>
    </div>
  );
};

export default Content;